{
  "id": "booking-concert-tickets-in-groups",
  "name": "Booking Concert Tickets in Groups",
  "tags": [
    "Binary Search",
    "Design",
    "Binary Indexed Tree",
    "Segment Tree"
  ],
  "description": "A concert hall has n rows numbered from 0 to n - 1, each with m seats, numbered from 0 to m - 1. You need to design a ticketing system that can allocate seats in the following cases:\n\n\n\tIf a group of k spectators can sit together in a row.\n\tIf every member of a group of k spectators can get a seat. They may or may not sit together.\n\n\nNote that the spectators are very picky. Hence:\n\n\n\tThey will book seats only if each member of their group can get a seat with row number less than or equal to maxRow. maxRow can vary from group to group.\n\tIn case there are multiple rows to choose from, the row with the smallest number is chosen. If there are multiple seats to choose in the same row, the seat with the smallest number is chosen.\n\n\nImplement the BookMyShow class:\n\n\n\tBookMyShow(int n, int m) Initializes the object with n as number of rows and m as number of seats per row.\n\tint[] gather(int k, int maxRow) Returns an array of length 2 denoting the row and seat number (respectively) of the first seat being allocated to the k members of the group, who must sit together. In other words, it returns the smallest possible r and c such that all [c, c + k - 1] seats are valid and empty in row r, and r <= maxRow. Returns [] in case it is not possible to allocate seats to the group.\n\tboolean scatter(int k, int maxRow) Returns true if all k members of the group can be allocated seats in rows 0 to maxRow, who may or may not sit together. If the seats can be allocated, it allocates k seats to the group with the smallest row numbers, and the smallest possible seat numbers in each row. Otherwise, returns false.\n\n\n \nExample 1:\n\nInput\n[\"BookMyShow\", \"gather\", \"gather\", \"scatter\", \"scatter\"]\n[[2, 5], [4, 0], [2, 0], [5, 1], [5, 1]]\nOutput\n[null, [0, 0], [], true, false]\n\nExplanation\nBookMyShow bms = new BookMyShow(2, 5); // There are 2 rows with 5 seats each \nbms.gather(4, 0); // return [0, 0]\n                  // The group books seats [0, 3] of row 0. \nbms.gather(2, 0); // return []\n                  // There is only 1 seat left in row 0,\n                  // so it is not possible to book 2 consecutive seats. \nbms.scatter(5, 1); // return True\n                   // The group books seat 4 of row 0 and seats [0, 3] of row 1. \nbms.scatter(5, 1); // return False\n                   // There is only one seat left in the hall.\n\n\n \nConstraints:\n\n\n\t1 <= n <= 5 * 104\n\t1 <= m, k <= 109\n\t0 <= maxRow <= n - 1\n\tAt most 5 * 104 calls in total will be made to gather and scatter.\n\n"
}