{
  "id": "build-an-array-with-stack-operations",
  "name": "Build an Array With Stack Operations",
  "tags": [
    "Array",
    "Stack",
    "Simulation"
  ],
  "description": "You are given an integer array target and an integer n.\n\nYou have an empty stack with the two following operations:\n\n\n\t\"Push\": pushes an integer to the top of the stack.\n\t\"Pop\": removes the integer on the top of the stack.\n\n\nYou also have a stream of the integers in the range [1, n].\n\nUse the two stack operations to make the numbers in the stack (from the bottom to the top) equal to target. You should follow the following rules:\n\n\n\tIf the stream of the integers is not empty, pick the next integer from the stream and push it to the top of the stack.\n\tIf the stack is not empty, pop the integer at the top of the stack.\n\tIf, at any moment, the elements in the stack (from the bottom to the top) are equal to target, do not read new integers from the stream and do not do more operations on the stack.\n\n\nReturn the stack operations needed to build target following the mentioned rules. If there are multiple valid answers, return any of them.\n\n \nExample 1:\n\nInput: target = [1,3], n = 3\nOutput: [\"Push\",\"Push\",\"Pop\",\"Push\"]\nExplanation: Initially the stack s is empty. The last element is the top of the stack.\nRead 1 from the stream and push it to the stack. s = [1].\nRead 2 from the stream and push it to the stack. s = [1,2].\nPop the integer on the top of the stack. s = [1].\nRead 3 from the stream and push it to the stack. s = [1,3].\n\n\nExample 2:\n\nInput: target = [1,2,3], n = 3\nOutput: [\"Push\",\"Push\",\"Push\"]\nExplanation: Initially the stack s is empty. The last element is the top of the stack.\nRead 1 from the stream and push it to the stack. s = [1].\nRead 2 from the stream and push it to the stack. s = [1,2].\nRead 3 from the stream and push it to the stack. s = [1,2,3].\n\n\nExample 3:\n\nInput: target = [1,2], n = 4\nOutput: [\"Push\",\"Push\"]\nExplanation: Initially the stack s is empty. The last element is the top of the stack.\nRead 1 from the stream and push it to the stack. s = [1].\nRead 2 from the stream and push it to the stack. s = [1,2].\nSince the stack (from the bottom to the top) is equal to target, we stop the stack operations.\nThe answers that read integer 3 from the stream are not accepted.\n\n\n \nConstraints:\n\n\n\t1 <= target.length <= 100\n\t1 <= n <= 100\n\t1 <= target[i] <= n\n\ttarget is strictly increasing.\n\n"
}