{
  "id": "design-skiplist",
  "name": "Design Skiplist",
  "tags": [
    "Linked List",
    "Design"
  ],
  "description": "Design a Skiplist without using any built-in libraries.\n\nA skiplist is a data structure that takes O(log(n)) time to add, erase and search. Comparing with treap and red-black tree which has the same function and performance, the code length of Skiplist can be comparatively short and the idea behind Skiplists is just simple linked lists.\n\nFor example, we have a Skiplist containing [30,40,50,60,70,90] and we want to add 80 and 45 into it. The Skiplist works this way:\n\n\nArtyom Kalinin [CC BY-SA 3.0], via Wikimedia Commons\n\nYou can see there are many layers in the Skiplist. Each layer is a sorted linked list. With the help of the top layers, add, erase and search can be faster than O(n). It can be proven that the average time complexity for each operation is O(log(n)) and space complexity is O(n).\n\nSee more about Skiplist: https://en.wikipedia.org/wiki/Skip_list\n\nImplement the Skiplist class:\n\n\n\tSkiplist() Initializes the object of the skiplist.\n\tbool search(int target) Returns true if the integer target exists in the Skiplist or false otherwise.\n\tvoid add(int num) Inserts the value num into the SkipList.\n\tbool erase(int num) Removes the value num from the Skiplist and returns true. If num does not exist in the Skiplist, do nothing and return false. If there exist multiple num values, removing any one of them is fine.\n\n\nNote that duplicates may exist in the Skiplist, your code needs to handle this situation.\n\n \nExample 1:\n\nInput\n[\"Skiplist\", \"add\", \"add\", \"add\", \"search\", \"add\", \"search\", \"erase\", \"erase\", \"search\"]\n[[], [1], [2], [3], [0], [4], [1], [0], [1], [1]]\nOutput\n[null, null, null, null, false, null, true, false, true, false]\n\nExplanation\nSkiplist skiplist = new Skiplist();\nskiplist.add(1);\nskiplist.add(2);\nskiplist.add(3);\nskiplist.search(0); // return False\nskiplist.add(4);\nskiplist.search(1); // return True\nskiplist.erase(0);  // return False, 0 is not in skiplist.\nskiplist.erase(1);  // return True\nskiplist.search(1); // return False, 1 has already been erased.\n\n \nConstraints:\n\n\n\t0 <= num, target <= 2 * 104\n\tAt most 5 * 104 calls will be made to search, add, and erase.\n\n"
}