{
  "id": "design-circular-queue",
  "name": "Design Circular Queue",
  "tags": [
    "Array",
    "Linked List",
    "Design",
    "Queue"
  ],
  "description": "Design your implementation of the circular queue. The circular queue is a linear data structure in which the operations are performed based on FIFO (First In First Out) principle, and the last position is connected back to the first position to make a circle. It is also called \"Ring Buffer\".\n\nOne of the benefits of the circular queue is that we can make use of the spaces in front of the queue. In a normal queue, once the queue becomes full, we cannot insert the next element even if there is a space in front of the queue. But using the circular queue, we can use the space to store new values.\n\nImplement the MyCircularQueue class:\n\n\n\tMyCircularQueue(k) Initializes the object with the size of the queue to be k.\n\tint Front() Gets the front item from the queue. If the queue is empty, return -1.\n\tint Rear() Gets the last item from the queue. If the queue is empty, return -1.\n\tboolean enQueue(int value) Inserts an element into the circular queue. Return true if the operation is successful.\n\tboolean deQueue() Deletes an element from the circular queue. Return true if the operation is successful.\n\tboolean isEmpty() Checks whether the circular queue is empty or not.\n\tboolean isFull() Checks whether the circular queue is full or not.\n\n\nYou must solve the problem without using the built-in queue data structure in your programming language. \n\n \nExample 1:\n\nInput\n[\"MyCircularQueue\", \"enQueue\", \"enQueue\", \"enQueue\", \"enQueue\", \"Rear\", \"isFull\", \"deQueue\", \"enQueue\", \"Rear\"]\n[[3], [1], [2], [3], [4], [], [], [], [4], []]\nOutput\n[null, true, true, true, false, 3, true, true, true, 4]\n\nExplanation\nMyCircularQueue myCircularQueue = new MyCircularQueue(3);\nmyCircularQueue.enQueue(1); // return True\nmyCircularQueue.enQueue(2); // return True\nmyCircularQueue.enQueue(3); // return True\nmyCircularQueue.enQueue(4); // return False\nmyCircularQueue.Rear();     // return 3\nmyCircularQueue.isFull();   // return True\nmyCircularQueue.deQueue();  // return True\nmyCircularQueue.enQueue(4); // return True\nmyCircularQueue.Rear();     // return 4\n\n\n \nConstraints:\n\n\n\t1 <= k <= 1000\n\t0 <= value <= 1000\n\tAt most 3000 calls will be made to enQueue, deQueue, Front, Rear, isEmpty, and isFull.\n\n"
}