{
  "id": "groups-of-strings",
  "name": "Groups of Strings",
  "tags": [
    "String",
    "Bit Manipulation",
    "Union Find"
  ],
  "description": "You are given a 0-indexed array of strings words. Each string consists of lowercase English letters only. No letter occurs more than once in any string of words.\n\nTwo strings s1 and s2 are said to be connected if the set of letters of s2 can be obtained from the set of letters of s1 by any one of the following operations:\n\n\n\tAdding exactly one letter to the set of the letters of s1.\n\tDeleting exactly one letter from the set of the letters of s1.\n\tReplacing exactly one letter from the set of the letters of s1 with any letter, including itself.\n\n\nThe array words can be divided into one or more non-intersecting groups. A string belongs to a group if any one of the following is true:\n\n\n\tIt is connected to at least one other string of the group.\n\tIt is the only string present in the group.\n\n\nNote that the strings in words should be grouped in such a manner that a string belonging to a group cannot be connected to a string present in any other group. It can be proved that such an arrangement is always unique.\n\nReturn an array ans of size 2 where:\n\n\n\tans[0] is the maximum number of groups words can be divided into, and\n\tans[1] is the size of the largest group.\n\n\n \nExample 1:\n\nInput: words = [\"a\",\"b\",\"ab\",\"cde\"]\nOutput: [2,3]\nExplanation:\n- words[0] can be used to obtain words[1] (by replacing 'a' with 'b'), and words[2] (by adding 'b'). So words[0] is connected to words[1] and words[2].\n- words[1] can be used to obtain words[0] (by replacing 'b' with 'a'), and words[2] (by adding 'a'). So words[1] is connected to words[0] and words[2].\n- words[2] can be used to obtain words[0] (by deleting 'b'), and words[1] (by deleting 'a'). So words[2] is connected to words[0] and words[1].\n- words[3] is not connected to any string in words.\nThus, words can be divided into 2 groups [\"a\",\"b\",\"ab\"] and [\"cde\"]. The size of the largest group is 3.  \n\n\nExample 2:\n\nInput: words = [\"a\",\"ab\",\"abc\"]\nOutput: [1,3]\nExplanation:\n- words[0] is connected to words[1].\n- words[1] is connected to words[0] and words[2].\n- words[2] is connected to words[1].\nSince all strings are connected to each other, they should be grouped together.\nThus, the size of the largest group is 3.\n\n\n \nConstraints:\n\n\n\t1 <= words.length <= 2 * 104\n\t1 <= words[i].length <= 26\n\twords[i] consists of lowercase English letters only.\n\tNo letter occurs more than once in words[i].\n\n"
}